app/views/main_site/my_courses.html.erb

          <td><%= "#{section.start_time.strftime("%H:%M")} - #{section.end_time.strftime("%H:%M")}" %></td>
          <td><%= section.sections_students.find_by(student_id: @person.id).grade %></td>
---
SELECT "sections_students".* FROM "sections_students" WHERE "sections_students"."section_id" = $1 AND "sections_students"."student_id" = $2 LIMIT $3  [["section_id", 4], ["student_id", 6], ["LIMIT", 1]]

            <td><%= section.instructor.full_name %></td>
            <td><%= section.sections_students.find_by(student_id: @person.id).grade %></td>
---
SELECT "sections_students".* FROM "sections_students" WHERE "sections_students"."section_id" = $1 AND "sections_students"."student_id" = $2 LIMIT $3  [["section_id", 3], ["student_id", 6], ["LIMIT", 1]]

        </tr>
        <% section.sections_students.each do |section_student| %>
---
SELECT "sections_students".* FROM "sections_students" WHERE "sections_students"."section_id" IN ($1, $2, $3)  [["section_id", 30], ["section_id", 90], ["section_id", 120]]