app/views/sections/_formnew.html.erb

SELECT "courses".* FROM "courses"
SELECT "instructors".* FROM "instructors"
---
  <ul class="list-group list-group-flush">
    <li class="list-group-item bg-dark bg-gradient w-100 p-2 text-light"><%= form.label :course_id, style: "display: block" %><%= form.collection_select :course_id, Course.all, :id, :full_course_title, { prompt: "Select a Course" } %></li>
    <li class="list-group-item bg-dark bg-gradient w-100 p-2 text-light"><%= form.label :instructor_id, style: "display: block" %><%= form.collection_select :instructor_id, Instructor.all, :id, :full_name, { prompt: "Select an Instructor" } %></li>