app/views/sections/_section.html.erb

SELECT "sections".* FROM "sections"
---
    <li class="list-group-item bg-dark bg-gradient w-100 p-2 text-light"><strong>Instructor: </strong><%= section.instructor.full_name %></li>
    <li class="list-group-item bg-dark bg-gradient w-100 p-2 text-light"><strong>Capacity: </strong> <%= section.sections_students.count %> / <%= section.capacity %></li>