app/views/courses/_form.html.erb

SELECT "departments".* FROM "departments"
---
    <%= form.label :department_id, style: "display: block" %>
    <%= form.collection_select :department_id, Department.all, :id, :name, { prompt: "Select a Department" } %>