app/controllers/main_site_controller.rb

  def my_courses
    @user = Student.find(6).user
    @person = @user.person
    current_semester_args = { semester: 'Winter', year: 2024 }
    semester_sort_order = {'Winter' => 1, 'Summer' => 2, 'Fall' => 3}

    @current_sections = @person.sections.where(current_semester_args).includes(:course)

    if @user.instructor?
      @current_sections = @current_sections.includes(sections_students: :student).all
    end

    @past_sections = @person.sections.where.not(current_semester_args).includes(:course)
    @past_sections = @past_sections.sort_by { |s| [-s.year, semester_sort_order[s.semester]] }
    @past_sections = @past_sections.group_by { |s| [s.year, s.semester] }
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 20], ["id", 50], ["id", 60], ["id", 70], ["id", 80], ["id", 90]]
SELECT "courses".* FROM "courses"
SELECT "sections".* FROM "sections" INNER JOIN "sections_students" ON "sections"."id" = "sections_students"."section_id" WHERE "sections_students"."student_id" = $1 AND NOT ("sections"."semester" = $2 AND "sections"."year" = $3)  [["student_id", 101], ["semester", "Winter"], ["year", 2024]]

  def unregister
    @user = Student.find(6).user
    section_id = params[:section_id]
    section_student = @user.student.sections_students.find_by(section_id: section_id)
    course_name = section_student.section.course.full_course_title
    section_student.destroy if section_student.present?
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "sections_students".* FROM "sections_students" WHERE "sections_students"."student_id" = $1 AND "sections_students"."section_id" = $2 LIMIT $3  [["student_id", 6], ["section_id", 4], ["LIMIT", 1]]
SELECT 1 AS one FROM "sections_students" WHERE "sections_students"."section_id" = $1 AND "sections_students"."student_id" = $2 LIMIT $3  [["section_id", 4], ["student_id", 6], ["LIMIT", 1]]
DELETE FROM "sections_students" WHERE "sections_students"."id" = $1  [["id", 1]]

  def register
    @user = Student.find(6).user
    section_id = params[:section_id]
    section = Section.find(section_id)
    if SectionsStudent.where(section_id: section_id, student_id: @user.student.id).any?
      redirect_to sections_path, notice: 'You are already registered for this course'
    else
      @user.student.sections_students.create(section_id: section_id)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "sections_students".* FROM "sections_students" WHERE "sections_students"."section_id" = $1 AND "sections_students"."student_id" = $2 LIMIT $3  [["section_id", 4], ["student_id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 131], ["LIMIT", 1]]
SELECT 1 AS one FROM "sections_students" WHERE "sections_students"."section_id" = $1 AND "sections_students"."student_id" = $2 LIMIT $3  [["section_id", 4], ["student_id", 6], ["LIMIT", 1]]
INSERT INTO "sections_students" ("section_id", "student_id", "grade") VALUES ($1, $2, $3) RETURNING "id"  [["section_id", 4], ["student_id", 6], ["grade", nil]]

  def change_grade
    @user = Instructor.find(1).user
    section_id, student_id, grade = params[:section_id], params[:student_id],  params[:grade]
    section_student = SectionsStudent.find_by(section_id: section_id, student_id: student_id)
    course_name = section_student.section.course.full_course_title
    student_name = section_student.student.full_name
    section_student.update(grade: grade) if section_student.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "sections_students".* FROM "sections_students" WHERE "sections_students"."section_id" = $1 AND "sections_students"."student_id" = $2 LIMIT $3  [["section_id", 4], ["student_id", 6], ["LIMIT", 1]]
UPDATE "sections_students" SET "grade" = $1 WHERE "sections_students"."id" = $2  [["grade", "A"], ["id", 6]]
SELECT 1 AS one FROM "sections" INNER JOIN "sections_students" ON "sections"."id" = "sections_students"."section_id" WHERE "sections_students"."student_id" = $1 AND "sections"."course_id" = $2 LIMIT $3  [["student_id", 101], ["course_id", 2], ["LIMIT", 1]]