app/controllers/main_site_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."instructor_id" = $1 AND NOT ("sections"."semester" = $2 AND "sections"."year" = $3)  [["instructor_id", 1], ["semester", "Winter"], ["year", 2024]]
---
  def my_courses
    @person = @user.person
    current_semester_args = { semester: 'Winter', year: 2024 }
    semester_sort_order = {'Winter' => 1, 'Summer' => 2, 'Fall' => 3}

    @current_sections = @person.sections.where(current_semester_args).includes(:course) # person's current sections (instructor or student)

    if @user.instructor?
      @current_sections = @current_sections.includes(sections_students: :student).all # inlude section_students if they are an instructor
    end

    @past_sections = @person.sections.where.not(current_semester_args).includes(:course) # student's sections from the past
    @past_sections = @past_sections.sort_by { |s| [-s.year, semester_sort_order[s.semester]] } # sort based on semester-year descending
    @past_sections = @past_sections.group_by { |s| [s.year, s.semester] } # group by semester-year pairs

SELECT 1 AS one FROM "sections" INNER JOIN "sections_students" ON "sections"."id" = "sections_students"."section_id" WHERE "sections_students"."student_id" = $1 AND "sections"."course_id" = $2 LIMIT $3  [["student_id", 101], ["course_id", 2], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def register
    student = @user.student
    section_id = params[:section_id]
    section = Section.find(section_id)
    if SectionsStudent.where(section_id: section_id, student_id: @user.student.id).any? # if already registered
      redirect_to sections_path, notice: 'Error: You are already registered for this section'
    elsif student.sections.where(course: section.course).any? # if already registered under different section
      redirect_to sections_path, notice: 'Error: You are already for this course under another section.'
    elsif section.sections_students.count >= section.capacity # if section full