app/controllers/sections_controller.rb

  def index
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save
---
INSERT INTO "sections" ("course_id", "instructor_id", "capacity", "semester", "year", "days", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @section.update(section_params)
---
UPDATE "sections" SET "semester" = $1, "year" = $2, "updated_at" = $3 WHERE "sections"."id" = $4  [["semester", "Fall"], ["year", 2023], ["updated_at", "2024-03-28 00:35:28.121378"], ["id", 3]]

    def set_section
      @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]